# ViewPositionFailures Properties

---
The BuiltInFailuresViewPositionFailures type exposes the following members.
| Name| Description
---|---|---
| CantMoveViewport|  Can't move Viewport when its placement is controlled by the assigned View Position.
| CropRequiredAlignment|  Can't move Viewport when its placement is controlled by the assigned View Position.
| ViewAnchorDoesNotSupportView|  The View Anchor ""%1!s!"" is not supported by view ""%2!s!"".
Top
#### Reference
BuiltInFailuresViewPositionFailures Class
Autodesk.Revit.DB Namespace